In [1]:
import pandas as pd

In [2]:
car = pd.read_csv('quikr_car.csv')
car.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [3]:
car.shape

(892, 6)

In [4]:
car.describe()

              name company  year          Price  kms_driven fuel_type
count          892     892   892            892         840       837
unique         525      48    61            274         258         3
top     Honda City  Maruti  2015  Ask For Price  45,000 kms    Petrol
freq            13     235   117             35          30       440

In [5]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [6]:
car['year'].unique()

array(['2007', '2006', '2018', '2014', '2015', '2012', '2013', '2016',
       '2010', '2017', '2008', '2011', '2019', '2009', '2005', '2000',
       '...', '150k', 'TOUR', '2003', 'r 15', '2004', 'Zest', '/-Rs',
       'sale', '1995', 'ara)', '2002', 'SELL', '2001', 'tion', 'odel',
       '2 bs', 'arry', 'Eon', 'o...', 'ture', 'emi', 'car', 'able', 'no.',
       'd...', 'SALE', 'digo', 'sell', 'd Ex', 'n...', 'e...', 'D...',
       ', Ac', 'go .', 'k...', 'o c4', 'zire', 'cent', 'Sumo', 'cab',
       't xe', 'EV2', 'r...', 'zest'], dtype=object)

# Pre-processing

Problems
1. years  have garbage values , converting to int 
2. price have other than int values , converting to int
3. kms driven have nan values , has commas ,converting to int
4. fuel type has nan values 
5. get first three words of name 
6. year has nan values

In [7]:
backup = car.copy()

In [12]:
car = car[car['year'].str.isnumeric()]

dtype('O')

In [13]:
car['year'].dropna(inplace=True)
car['year'] = car['year'].astype(int)

In [14]:
car.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [15]:
car['Price']=car['Price'].str.replace(',','')

In [16]:
car['Price'].info()

<class 'pandas.core.series.Series'>
Int64Index: 842 entries, 0 to 891
Series name: Price
Non-Null Count  Dtype
--------------  -----
842 non-null    object
dtypes: object(1)
memory usage: 13.2+ KB

In [17]:
car = car[car['Price'] != 'Ask For Price' ]

In [18]:
car['Price'] = car['Price'].astype(int)

In [19]:
car['kms_driven']=car['kms_driven'].str.replace(' kms','')
car['kms_driven']=car['kms_driven'].str.replace(',','')

In [20]:
car = car[car['kms_driven'].str.isnumeric()]

In [21]:
car['kms_driven'].astype(int)

0       45000
1          40
3       28000
4       36000
6       41000
        ...
883     50000
885     30000
886    132000
888     27000
889     40000
Name: kms_driven, Length: 817, dtype: int32

In [22]:
car['fuel_type'].unique()

array(['Petrol', 'Diesel', nan, 'LPG'], dtype=object)

In [23]:
car['fuel_type'].dropna(inplace=True)

In [24]:
car['name']=car['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [25]:
car.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int32
 3   Price       817 non-null    int32
 4   kms_driven  817 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int32(2), object(4)
memory usage: 38.3+ KB

In [26]:
car['kms_driven'].dropna(inplace=True)
car['kms_driven'] = car['kms_driven'].astype(int)

In [27]:
car['kms_driven'].dtype

dtype('int32')

In [28]:
car.reset_index(drop = True)

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
812      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
813          Tata Indica V2      Tata  2009  110000       30000    Diesel
814    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
815            Tata Zest XM      Tata  2018  260000       27000    Diesel
816      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[817 rows x 6 columns]

In [29]:
car.describe()

              year         Price     kms_driven
count   817.000000  8.170000e+02     817.000000
mean   2012.440636  4.115503e+05   46250.714810
std       4.002354  4.749173e+05   34283.745254
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.900000e+05   56758.000000
max    2019.000000  8.500003e+06  400000.000000

In [30]:
car = car[car['Price']<4e6]

In [31]:
car.to_csv('cleaned.csv')

# MODEL TRAINING

In [34]:
from sklearn.pipeline import make_pipeline
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.linear_model import LinearRegression
from sklearn.tree import DecisionTreeRegressor
from sklearn.neighbors import KNeighborsRegressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score
from sklearn.model_selection import train_test_split
from sklearn.pipeline import make_pipeline
from sklearn.compose import make_column_transformer
from sklearn.preprocessing import StandardScaler

In [35]:
X = car.drop(columns='Price')
y = car['Price']

In [36]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [37]:
ohE = OneHotEncoder()
ohE.fit(X[['name','company','fuel_type']])

OneHotEncoder()

In [105]:
X,y

(                       name   company  year  kms_driven fuel_type
 0       Hyundai Santro Xing   Hyundai  2007       45000    Petrol
 1       Mahindra Jeep CL550  Mahindra  2006          40    Diesel
 3         Hyundai Grand i10   Hyundai  2014       28000    Petrol
 4    Ford EcoSport Titanium      Ford  2014       36000    Diesel
 6                 Ford Figo      Ford  2012       41000    Diesel
 ..                      ...       ...   ...         ...       ...
 883      Maruti Suzuki Ritz    Maruti  2011       50000    Petrol
 885          Tata Indica V2      Tata  2009       30000    Diesel
 886    Toyota Corolla Altis    Toyota  2009      132000    Petrol
 888            Tata Zest XM      Tata  2018       27000    Diesel
 889      Mahindra Quanto C8  Mahindra  2013       40000    Diesel

 [816 rows x 5 columns],
 0       80000
 1      425000
 3      325000
 4      575000
 6      175000
         ...
 883    270000
 885    110000
 886    300000
 888    260000
 889    390000
 Name: Price, Length: 816, dtype: int32)

In [106]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import make_pipeline
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.linear_model import LinearRegression
from sklearn.neighbors import KNeighborsRegressor
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score
from sklearn.linear_model import ElasticNet

# Define the column transformer
column_transform = ColumnTransformer(
    transformers=[
        ('onehot', OneHotEncoder(categories=ohE.categories_), ['name', 'company', 'fuel_type']),
        ('scaler', StandardScaler(), ['year', 'kms_driven'])], # Add your feature names to be scaled],
    remainder='passthrough'
)

# Define a list of regression models
regression_models = [LinearRegression(), KNeighborsRegressor(),  DecisionTreeRegressor(), RandomForestRegressor(),ElasticNet()]

# Iterate over each regression model
for model in regression_models:
    # Create a pipeline with the current model
    pipe = make_pipeline(column_transform, model)
    
    # Fit the pipeline on the training data
    pipe.fit(X_train, y_train)
    
    # Make predictions on the test data
    y_pred = pipe.predict(X_test)
    
    # Calculate R2 score
    r2 = r2_score(y_test, y_pred)
    
    # Print the R2 score for the current model
    print(f"R2 Score for {type(model).__name__}: {r2}")

R2 Score for LinearRegression: 0.5803601211419227
R2 Score for KNeighborsRegressor: 0.3727935439820851
R2 Score for DecisionTreeRegressor: 0.5387644177806942
R2 Score for RandomForestRegressor: 0.4935598400008272
R2 Score for ElasticNet: 0.14889788182492447

In [38]:
column_transform = make_column_transformer((OneHotEncoder(categories=ohE.categories_),['name','company','fuel_type']),
                                        remainder = 'passthrough')

from above we conclude that linear regression predicts better for this datasets

In [39]:

scores=[]
for i in range(1000):
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=i)
    lr = LinearRegression()
    pipe = make_pipeline(column_transform,lr)
    pipe.fit(X_train,y_train)
    y_pred = pipe.predict(X_test)
    scores.append(r2_score(y_test,y_pred))

In [40]:
import numpy as np
np.argmax(scores) #returns the index of largest number

652

In [41]:
scores[np.argmax(scores)] #score at largest number's index

0.8405485610345255

In [44]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=np.argmax(scores))
lr = LinearRegression()
pipe = make_pipeline(column_transform,lr)
pipe.fit(X_train,y_train)
y_pred = pipe.predict(X_test)
r2_score(y_test,y_pred)

0.8405485610345255

In [45]:
import pickle

In [46]:
pickle.dump(pipe,open('LinearRegressionModel.pkl','wb'))

In [48]:
pipe.predict(pd.DataFrame([['Maruti Suzuki Swift','Maruti',2019,100,'Petrol']],columns=['name','company','year','kms_driven','fuel_type']))

array([481675.37464675])